doc/apertium-kaz.org

# -*- mode: org; -*-

* =APERTIUM-KAZ=: A MORPHOLOGICAL TRANSDUCER AND DISAMBIGUATOR FOR KAZAKH

WARNING: this is an early draft.

What follows is the documentation for =apertium-kaz= -- a morphological
transducer and disambiguator for Kazakh. First draft of this documentation was
written, or, rather, assembled from various writings from [[https://wiki.apertium.org][Apertium's wiki]] and
then extended with more details by selimcan on September 2018 for members of
the `Deep Learning for Sequential Models in Natural Language Processing with
Applications to Kazakh' (dlsmnlpak) research group at Nazarbayev University and
elsewhere. That being said, I hope that it will be useful for anyone who uses
apertium-kaz and maybe wants to extend it with more stems. One of the goals of
the dlsmnlpak research project is to develop an annotated corpus of Kazakh, and
extend apertium-kaz with more stems and probabilistic guessing/tagging
capabilities. Most of the things said in this guide might be applicable to
Apertium's transducers for other Turkic languages as well.

----

*Apertium-kaz* is a morphological transducer and disambiguator for Kazakh,
currently under development. It is intended to be compatible with transducers
for other Turkic languages so that they can be translated between. It's used in
the following language pairs:

- Kazakh and Tatar
- English and Kazakh
- Kyrgyz and Kazakh
- Kazakh and Karakalpak
- Khalkha and Kazakh
- Kazakh and Russian

** Installation

** Usage

