doc/apertium-kaz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>apertium-kaz</title>
<!-- 2018-09-13 Thu 04:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Илнар Сәлимҗанов" />
</head>
<body>
<div id="content">
<h1 class="title">apertium-kaz</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <code>APERTIUM-KAZ</code>: A MORPHOLOGICAL TRANSDUCER AND DISAMBIGUATOR FOR KAZAKH</h2>
<div class="outline-text-2" id="text-1">
<p>
WARNING: this is an early draft.
</p>

<p>
What follows is the documentation for <code>apertium-kaz</code> &#x2013; a morphological
transducer and disambiguator for Kazakh. First draft of this documentation was
written, or, rather, assembled from various writings from <a href="https://wiki.apertium.org">Apertium's wiki</a> and
then extended with more details by selimcan on September 2018 for members of
the `Deep Learning for Sequential Models in Natural Language Processing with
Applications to Kazakh' (dlsmnlpak) research group at Nazarbayev University and
elsewhere. That being said, I hope that it will be useful for anyone who uses
apertium-kaz and maybe wants to extend it with more stems. One of the goals of
the dlsmnlpak research project is to develop an annotated corpus of Kazakh, and
extend apertium-kaz with more stems and probabilistic guessing/tagging
capabilities. Most of the things said in this guide might be applicable to
Apertium's transducers for other Turkic languages as well.
</p>

<p>
-&#x2014;
</p>

<p>
<b>Apertium-kaz</b> is a morphological transducer and disambiguator for Kazakh,
currently under development. It is intended to be compatible with transducers
for other Turkic languages so that they can be translated between. It's used in
the following language pairs:
</p>

<ul class="org-ul">
<li>Kazakh and Tatar
</li>
<li>English and Kazakh
</li>
<li>Kyrgyz and Kazakh
</li>
<li>Kazakh and Karakalpak
</li>
<li>Khalkha and Kazakh
</li>
<li>Kazakh and Russian
</li>
</ul>
</div>
