doc/apertium-kaz.org
** Annotating texts using =apertium-kaz= and extending it with more stems while doing so
 
Imagine the following scenario: a linguist is annotating a Kazakh text with
morphological information, taking the output of =kaz-morph= or =kaz-tagger= as
a starting point. Since the coverage of =apertium-kaz= at the time of this
writing (September 2018) is about 95%, #+BEGIN_COMMENT TODO measure this
automatically and put the result here #+END_COMMENT it is reasonable to assume
that, in the text that she is annotating, the linguist will encounter stems
unrecognized by the transducer.

Each stem in =apertium-kaz.kaz.lexc= -- the lexicon of the transducer -- can be
followed by one ore more affixes of Kazakh, and thus cover many wordforms. Thus
when annotating a text with morphological tags, it is wise to add missing stems
to the lexicon frequently, re-compile =apertium-kaz=

The most effective way of working is arguably the following way of working in
`layers':

- pass the text that you want to annotate through the =kaz-tagger= mode
- read the output from the beginning
- for each unrecognized wordform:
  - identify its stem, following the information on that below
  - try to analyse the stem: =echo "stem" | apertium -d . kaz-morph=
  - if success: add the unrec. wordform to the end of =apertium-kaz.kaz.lexc=
    this way: =wordform
  - else: add stem to =apertium-kaz.kaz.lexc= this way: =stem:stem LEXICON ; !
    "english gloss"=, where you choose lexicon following the guidelines below
  - recompile =apertium-kaz=
  - pass the rest of the text you're annotating through the =kaz-tagger= mode
  - make sure that the wordform is correctly analysed now
  - repeat for the above steps for the rest of the text
- once there are no unrecognized wordforms, start selecting the correct
  analysis, if there are multiple. That is, filling in the third column of the
  spreadsheet.
- if the input wordform is misspelled, do not correct it in place, but add the
  sixth column in that row, in which give the properly spelled form of the
  word. Why? Misspellings info is quite valuable info, which will alllow us to
  do automatic spelling correction and thus making =apertium-kaz= more robust.
- add the resulting file to =apertium-kaz/corpus=, commit and push

TODO Later there will be a program/Racket-based programming language ( which we
will call Apertium#), which, given some free-form text, does some of the above
and calculates probabilities automatically, under the hood,.

What does this output format give us?

- All information potentially useful for statistical training +
  meta-information (license, source, genre, year etc) in one place.
- Machine-readable.
- Spreadsheet friendly = easy & fast to edit.
- Close/equivalent to the format used in NoSketchEngine and other corpus
  processing tools, thus less overhead with converting etc.

- getting to 100% coverage;
One of the goals === Guidelines for adding stems ===

==== An overview of the process ====

If you see that a wordform is not supported by apertium-kaz and you want to add it, you have to figure out three things:

# what the stem of the word is (to be exact, what the left-hand side and the right-hand side of the the entry should be),
# whether or not that stem is already in apertium-kaz, and
# (if it isn't or it isn't analysed as something that you expect) which continuation lexicon (read: paradigm) you should assign the stem to.

Here is an example of a word already in the apertium-kaz.kaz.lexc file:

<pre>
кітап:кітап N1 ; ! "book"
</pre>

As in this example, in most cases, the left hand-side and the right-hand side of the entry are the same. The left-hand side is the underlying form, the right-hand is the surface form. Continuation lexicon in this example is N1. What comes after the exclamation mark '!' are comments. Glosses are a good thing to have, but technically they are only a comment, and thus optional.

Here is an example where the left and right hand sides are not the same:

<pre>
күн% тәртібі:күн% тәртіп N-COMPOUND-PX ; ! ""
</pre>

This has been implemented in that way so that forms like "күн тәртіптері" can also be analysed as forms of the word "күн тәртібі".

The example above also shows that spaces in a word have to be escaped with %. So is the hyphen sign:

<pre>
мән%-жай:мән%-жай N1 ; ! ""
</pre>

==== General ====

- Before adding a stem, be sure it does not already exist in lexc. A good way to do that is to look up stem(s) you want to add with <code>lt-proc kaz.automorf.bin</code>. In some cases, you'll see that the stem isn't analysed at all:

^foo/*foo$

In some cases, it will be analysed, but as something else than what you want to add it as:

^Жол/жол<adj>$ ^жөндеуші/жөнде<v><tv><gpr_pot>$^./.<sent>$
 
(assuming that you want to add "Жол жөндеуші as a company name, which it happens to be).

Another, probably more relevant example:

<pre>
apertium-kaz$ echo "қабылдау" | apertium -d . kaz-tagger 
^қабылдау/қабылда<v><tv><ger><nom>$^./.<sent>$
</pre>

(supposing that some other forms of the word, say with case affixes, like e.g. "қабылдауды" weren't analysed (see the next paragraph) and thus you looked up қабылдау in <code>kaz.autogen.bin</code>). Looking the *stem* up (note: not the surface form, the stem) with the <code>lt-proc kaz.autogen.bin</code> command before adding it to the lexc file gives you a chance to save some work and to avoid addiing the same thing twice.

In the third case, you will see that the stem is already there, is linked to the right lexicon, but some surface forms of the word are not analysed. This means that either there is a problem with the phonology part, or you've discovered some affix currently not supported by apertium-kaz. Both issues have to be documented/reported (the simplest way would be just to add an 'ISSUES' file to apertium-kaz and commit it).

- Provide a commit message saying what you did.  At a bare minimum, "adding more stems" is okay, but "a" or "ф" is not.  Try to be more informative though; e.g. "added stems from story, mostly NP-TOP and NP-ANT" or similar.
- Many stems exhibit a voicing alternation like п/б, к/г, қ/ғ.  This is processed automatically by twol, but these stems ''must'' be added with the ''voiceless'' consonant (п, к, қ), e.g <code>тақ:тақ V-TV ;</code>
** Stems from Russian that end with one of the voiced consonants (б, г), such as <code>геолог</code> should be entered as spelled, but should be put in the right category for foreign words (e.g., if a noun, then <code>N5</code>).
- Words that have an inserted ‹ы› or ‹і› in some forms should get <code>%{y%}</code> in that spot on the right side, e.g. <code>орын:ор%{y%}н N1 ;</code>.
