doc/apertium-kaz.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Installation</h3>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Usage</h3>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Annotating texts using <code>apertium-kaz</code> and extending it with more stems while doing so</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Imagine the following scenario: a linguist is annotating a Kazakh text with
morphological information, taking the output of <code>kaz-morph</code> or <code>kaz-tagger</code> as
a starting point. Since the coverage of <code>apertium-kaz</code> at the time of this
writing (September 2018) is about 95%, #+BEGIN<sub>COMMENT</sub> TODO measure this
automatically and put the result here #+END<sub>COMMENT</sub> it is reasonable to assume
that, in the text that she is annotating, the linguist will encounter stems
unrecognized by the transducer.
</p>

<p>
Each stem in <code>apertium-kaz.kaz.lexc</code> &#x2013; the lexicon of the transducer &#x2013; can be
followed by one ore more affixes of Kazakh, and thus cover many wordforms. Thus
when annotating a text with morphological tags, it is wise to add missing stems
to the lexicon frequently, re-compile <code>apertium-kaz</code>
</p>

<p>
The most effective way of working is arguably the following way of working in
`layers':
</p>

<ul class="org-ul">
<li>pass the text that you want to annotate through the <code>kaz-tagger</code> mode
</li>
<li>read the output from the beginning
</li>
<li>for each unrecognized wordform:
<ul class="org-ul">
<li>identify its stem, following the information on that below
</li>
<li>try to analyse the stem: <code>echo "stem" | apertium -d . kaz-morph</code>
</li>
<li>if success: add the unrec. wordform to the end of <code>apertium-kaz.kaz.lexc</code>
    this way: =wordform
</li>
<li>else: add stem to <code>apertium-kaz.kaz.lexc</code> this way: =stem:stem LEXICON ; !
"english gloss"=, where you choose lexicon following the guidelines below
</li>
<li>recompile <code>apertium-kaz</code>
</li>
<li>pass the rest of the text you're annotating through the <code>kaz-tagger</code> mode
</li>
<li>make sure that the wordform is correctly analysed now
</li>
<li>repeat for the above steps for the rest of the text
</li>
</ul>
</li>
<li>once there are no unrecognized wordforms, start selecting the correct
analysis, if there are multiple. That is, filling in the third column of the
spreadsheet.
</li>
<li>if the input wordform is misspelled, do not correct it in place, but add the
sixth column in that row, in which give the properly spelled form of the
word. Why? Misspellings info is quite valuable info, which will alllow us to
do automatic spelling correction and thus making <code>apertium-kaz</code> more robust.
</li>
<li>add the resulting file to <code>apertium-kaz/corpus</code>, commit and push
</li>
</ul>

<p>
TODO Later there will be a program/Racket-based programming language ( which we
will call Apertium#), which, given some free-form text, does some of the above
and calculates probabilities automatically, under the hood,.
</p>

<p>
What does this output format give us?
</p>

<ul class="org-ul">
<li>All information potentially useful for statistical training +
meta-information (license, source, genre, year etc) in one place.
</li>
<li>Machine-readable.
</li>
<li>Spreadsheet friendly = easy &amp; fast to edit.
</li>
<li>Close/equivalent to the format used in NoSketchEngine and other corpus
processing tools, thus less overhead with converting etc.
</li>

<li>getting to 100% coverage;
</li>
</ul>
<p>
One of the goals <code>=</code> Guidelines for adding stems <code>=</code>
</p>

<p>
<code>==</code> An overview of the process <code>==</code>
</p>

<p>
If you see that a wordform is not supported by apertium-kaz and you want to add it, you have to figure out three things:
</p>

<p>
Here is an example of a word already in the apertium-kaz.kaz.lexc file:
</p>

<p>
&lt;pre&gt;
кітап:кітап N1 ; ! "book"
&lt;/pre&gt;
</p>

<p>
As in this example, in most cases, the left hand-side and the right-hand side of the entry are the same. The left-hand side is the underlying form, the right-hand is the surface form. Continuation lexicon in this example is N1. What comes after the exclamation mark '!' are comments. Glosses are a good thing to have, but technically they are only a comment, and thus optional.
</p>

<p>
Here is an example where the left and right hand sides are not the same:
</p>

<p>
&lt;pre&gt;
күн% тәртібі:күн% тәртіп N-COMPOUND-PX ; ! ""
&lt;/pre&gt;
</p>

<p>
This has been implemented in that way so that forms like "күн тәртіптері" can also be analysed as forms of the word "күн тәртібі".
</p>

<p>
The example above also shows that spaces in a word have to be escaped with %. So is the hyphen sign:
</p>

<p>
&lt;pre&gt;
мән%-жай:мән%-жай N1 ; ! ""
&lt;/pre&gt;
</p>

<p>
<code>==</code> General <code>==</code>
</p>

<ul class="org-ul">
<li>Before adding a stem, be sure it does not already exist in lexc. A good way to do that is to look up stem(s) you want to add with &lt;code&gt;lt-proc kaz.automorf.bin&lt;/code&gt;. In some cases, you'll see that the stem isn't analysed at all:
</li>
</ul>

<p>
^foo/*foo$
</p>

<p>
In some cases, it will be analysed, but as something else than what you want to add it as:
</p>

<p>
^Жол/жол&lt;adj&gt;$ ^жөндеуші/жөнде&lt;v&gt;&lt;tv&gt;&lt;gpr<sub>pot</sub>&gt;\(^./.<sent>\)
</p>

<p>
(assuming that you want to add "Жол жөндеуші as a company name, which it happens to be).
</p>

<p>
Another, probably more relevant example:
</p>

<p>
&lt;pre&gt;
apertium-kaz$ echo "қабылдау" | apertium -d . kaz-tagger 
^қабылдау/қабылда&lt;v&gt;&lt;tv&gt;&lt;ger&gt;&lt;nom&gt;\(^./.<sent>\)
&lt;/pre&gt;
</p>

<p>
(supposing that some other forms of the word, say with case affixes, like e.g. "қабылдауды" weren't analysed (see the next paragraph) and thus you looked up қабылдау in &lt;code&gt;kaz.autogen.bin&lt;/code&gt;). Looking the <b>stem</b> up (note: not the surface form, the stem) with the &lt;code&gt;lt-proc kaz.autogen.bin&lt;/code&gt; command before adding it to the lexc file gives you a chance to save some work and to avoid addiing the same thing twice.
</p>

<p>
In the third case, you will see that the stem is already there, is linked to the right lexicon, but some surface forms of the word are not analysed. This means that either there is a problem with the phonology part, or you've discovered some affix currently not supported by apertium-kaz. Both issues have to be documented/reported (the simplest way would be just to add an 'ISSUES' file to apertium-kaz and commit it).
</p>

<ul class="org-ul">
<li>Provide a commit message saying what you did.  At a bare minimum, "adding more stems" is okay, but "a" or "ф" is not.  Try to be more informative though; e.g. "added stems from story, mostly NP-TOP and NP-ANT" or similar.
</li>
<li>Many stems exhibit a voicing alternation like п/б, к/г, қ/ғ.  This is processed automatically by twol, but these stems ''must'' be added with the ''voiceless'' consonant (п, к, қ), e.g &lt;code&gt;тақ:тақ V-TV ;&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Stems from Russian that end with one of the voiced consonants (б, г), such as &lt;code&gt;геолог&lt;/code&gt; should be entered as spelled, but should be put in the right category for foreign words (e.g., if a noun, then &lt;code&gt;N5&lt;/code&gt;).</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Words that have an inserted ‹ы› or ‹і› in some forms should get &lt;code&gt;%{y%}&lt;/code&gt; in that spot on the right side, e.g. &lt;code&gt;орын:ор%{y%}н N1 ;&lt;/code&gt;.
</li>
</ul>
</div>
</div>
