doc/apertium-kaz.org
** Words that are commonly written in both forms (e.g., орнында and орынында) need special treatment: add <code>! Dir/LR</code> after the form that should not be generated (i.e., the form that is the non-normative version), and add <code>! Err/Orth</code> after it too if it should be considered a spelling mistake.
- Any changes to continuation classes should be discussed on the apertium-turkic mailing list.

Most likely, a word not covered by apertium-kaz already will be an open class word. Below are some comments on the open-class word lexicons.

==== Verbs ====
- Categorise correctly according to IV or TV status:
** IV = intransitive verbs; TV = transitive verbs
** If the verb can take a direct object with -НЫ, then it's not IV; otherwise it is TV
** For phrasal verbs (e.g,. "қабыл ал", "пайда бол", "мойынға ал"), do not categorise it according to its elements; instead treat it as a single verb (TV, IV, TV).
- There should be no infinitival final -у or -ю.  It is best to take the part of the verb before -GAн or -DI in those forms.
** Infinitives ending in -ю should end in ‹й› instead, e.g ‹сүю› should be entered as <code>сүй</code>
** Some verbs have a "hidden" ‹ы› or ‹і› under the ‹у›, for example <code>ері</code>, <code>аршы</code>, <code>аңды</code>, etc.  These verb stems should be added ''with'' the ‹ы› or ‹і›.
** Of course, verbs with ‹у› in the stem should keep the ‹у›, like <code>жу</code>, <code>қу</code>, <code>жау</code>, etc.
- Do not add passive or cooperative forms of verb stems (e.g., ‹тартыл› is passive of ‹тарт›, and ‹тартыс› is cooperative) unless absolutely needed for translation.  In this case, put <code>! Use/MT ! Der/Pass</code> or <code>! Use/MT ! Der/Coop</code> after the entry, respectively.
- If you add a causative form of a verb (e.g., ‹отырғыз› is causative of ‹отыр›), put <code>! Der/Caus</code> after it.

==== Nouns ====
- Some nouns end in ‹ә›, and have interesting or inconsistent-looking phonology, like <code>күнә</code>, <code>кінә</code>.  These should be added with the right side missing its ‹ә› and in the class N1-Ә.  E.g., <code>күнә:күн N1-Ә ;</code>
- Nouns from Russian should be classified as <code>N5</code>
** ''especially'' if the last vowel is ‹и› or ‹у›
** ''especially'' if they end with a consonant that would normally be voiced before a vowel-initial suffix in Kazakh words (п, к)
- Nouns that are compounds ending in a possessive form (like ‹ауа райы›) should be categorised into the <code>N-COMPOUND-PX</code> category and entered without the possessive ending on the right side, e.g. <code>ауа% райы:ауа% рай N-COMPOUND-PX ; ! "weather,climate"</code>
- If you're adding a noun that can also be used as an adjective, think whether it's actually an adjective or actually a noun and add it to the right category.  You'll want to subcategorise it correctly so that e.g. if it's a noun it can also take the {{tag|attr}} tag.

==== Adjectives ====
- The basic categorisation of adjectives depends on whether it takes comparative morphology (-ЫрАҚ), can be substantivised (acts like a noun), and/or can be adverbialised (acts like an adverb).  Be sure to put the adjective in the right category according what those categories allow.

- If you're adding an adjective that can also be used as a noun, think whether it's actually an adjective or actually a noun and add it to the right category.  You'll want to subcategorise it correctly so that e.g. if it's an adjective it can also take the {{tag|subst}} tag.

==== Adverbs ====
- If you want to add an adverb, first think whether the word is really an adjective that can be used like an adverb.  If this is the case, then add it as an adjective in the appropriate adjective class that can take the {{tag|advl}} tag.  In the bidix, you'll want to translate the {{tag|adj}} and the {{tag|adj}}{{tag|advl}} forms differently.

=== Additional tags ===

In a .lexc file, after the '!' you will also see <code>Dir/LR</code>, <code>Dir/RL</code>, <code>Err/Orth</code> and <code>Use/MT</code> comments. The meaning of them is as follows:

'''<code>Dir/LR</code>''' means: analyse this surface form, but don't generate it. Here is a good example:

<pre>
сұхбат:сұқбат N1 ; ! "conversation/interview" Dir/LR
сұхбат:сұхбат N1 ; ! "conversation/interview"
</pre>

In other words, <code>Dir/LR</code> marks alternative spellings of a word. If the alternative spelling isn't just alternative, but actually erroneous (but occurs quite commonly so that you want to support it), it is marked with the '''<code>Err/Orth</code>''' tag:

<pre>
орын:ор%{y%}н N1 ; ! "place,seat"
орын:орын N1 ; ! "place,seat"  ! Dir/LR ! Err/Orth
</pre>

"Орыны" for example, is considered erroneous spelling of "орын<n><px3sp><nom>". Such markings will allow us to produce better spell checkers.

In the examples above, if you don't mark either of the stems with <code>Dir/LR</code>, then the Kazakh generator, (if we personify it a bit) given a string like "^сұхбат<n><nom>$ for input, won't know which surface form to choose and will output both, separated with a slash: сұхбат/сұқбат.

As the name suggests, '''<code>Dir/RL</code>''' has the meaning opposite to <code>Dir/LR</code>: 'generate this surface form, but do not analyse it'. You won't see it much in a lexc file and almost certainly won't need to mark a stem you add as Dir/RL. Here is an example though: 

<pre>
да:%~да CC ; ! "also" Dir/RL
</pre>

The conjunction ^да<cnj$ gets generated as "~да". This is necessary for a somewhat hacky way of handling the vowel harmony (read: making sure that the "да" gets rendered as "де" when the preceding word has front vowels) in cases where the standard way of handling the vowel harmony (read: [[twol]]) fails because the preceding word is unknown. 

'''Use/MT''' (at least, in its original usage) marks (compound) words which are needed for translation, but probably shouldn't be in a "vanilla" Kazakh transducer:

<pre>
қайда% болса% сонда:қайда% болса% сонда PRON-IND ; ! "anywhere" Use/MT
</pre>

It has been also used to mark words which the person who added them wasn't sure how to classify. Such words will be reviewed later.

=== Full inventory of lexicons the stems can be linked to ===

It is useful to distinguish two classes of lexicons:
# lexicons which are only used as continuations for the other lexicons, and
# lexicons which are continuations for stems.

Here is an attempt to document the lexicons of the second kind found in the <code>apertium-kaz.kaz.lexc</code> file (so that: 1. people can add stems to a lexc file without having to read the lexc file itself 2. we can re-evaluate our decisions):
 
Nouns:
** N1
** N-COMPOUND-PX
** N5
** N1-ABBR
