doc/apertium-kaz.html
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Words that are commonly written in both forms (e.g., орнында and орынында) need special treatment: add &lt;code&gt;! Dir/LR&lt;/code&gt; after the form that should not be generated (i.e., the form that is the non-normative version), and add &lt;code&gt;! Err/Orth&lt;/code&gt; after it too if it should be considered a spelling mistake.</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Any changes to continuation classes should be discussed on the apertium-turkic mailing list.
</li>
</ul>

<p>
Most likely, a word not covered by apertium-kaz already will be an open class word. Below are some comments on the open-class word lexicons.
</p>

<p>
<code>==</code> Verbs <code>==</code>
</p>
<ul class="org-ul">
<li>Categorise correctly according to IV or TV status:
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> IV = intransitive verbs; TV = transitive verbs</h3>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> If the verb can take a direct object with -НЫ, then it's not IV; otherwise it is TV</h3>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> For phrasal verbs (e.g,. "қабыл ал", "пайда бол", "мойынға ал"), do not categorise it according to its elements; instead treat it as a single verb (TV, IV, TV).</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>There should be no infinitival final -у or -ю.  It is best to take the part of the verb before -GAн or -DI in those forms.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Infinitives ending in -ю should end in ‹й› instead, e.g ‹сүю› should be entered as &lt;code&gt;сүй&lt;/code&gt;</h3>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Some verbs have a "hidden" ‹ы› or ‹і› under the ‹у›, for example &lt;code&gt;ері&lt;/code&gt;, &lt;code&gt;аршы&lt;/code&gt;, &lt;code&gt;аңды&lt;/code&gt;, etc.  These verb stems should be added ''with'' the ‹ы› or ‹і›.</h3>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Of course, verbs with ‹у› in the stem should keep the ‹у›, like &lt;code&gt;жу&lt;/code&gt;, &lt;code&gt;қу&lt;/code&gt;, &lt;code&gt;жау&lt;/code&gt;, etc.</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Do not add passive or cooperative forms of verb stems (e.g., ‹тартыл› is passive of ‹тарт›, and ‹тартыс› is cooperative) unless absolutely needed for translation.  In this case, put &lt;code&gt;! Use/MT ! Der/Pass&lt;/code&gt; or &lt;code&gt;! Use/MT ! Der/Coop&lt;/code&gt; after the entry, respectively.
</li>
<li>If you add a causative form of a verb (e.g., ‹отырғыз› is causative of ‹отыр›), put &lt;code&gt;! Der/Caus&lt;/code&gt; after it.
</li>
</ul>

<p>
<code>==</code> Nouns <code>==</code>
</p>
<ul class="org-ul">
<li>Some nouns end in ‹ә›, and have interesting or inconsistent-looking phonology, like &lt;code&gt;күнә&lt;/code&gt;, &lt;code&gt;кінә&lt;/code&gt;.  These should be added with the right side missing its ‹ә› and in the class N1-Ә.  E.g., &lt;code&gt;күнә:күн N1-Ә ;&lt;/code&gt;
</li>
<li>Nouns from Russian should be classified as &lt;code&gt;N5&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> ''especially'' if the last vowel is ‹и› or ‹у›</h3>
</div>
<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> ''especially'' if they end with a consonant that would normally be voiced before a vowel-initial suffix in Kazakh words (п, к)</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>Nouns that are compounds ending in a possessive form (like ‹ауа райы›) should be categorised into the &lt;code&gt;N-COMPOUND-PX&lt;/code&gt; category and entered without the possessive ending on the right side, e.g. &lt;code&gt;ауа% райы:ауа% рай N-COMPOUND-PX ; ! "weather,climate"&lt;/code&gt;
</li>
<li>If you're adding a noun that can also be used as an adjective, think whether it's actually an adjective or actually a noun and add it to the right category.  You'll want to subcategorise it correctly so that e.g. if it's a noun it can also take the {{tag|attr}} tag.
</li>
</ul>

<p>
<code>==</code> Adjectives <code>==</code>
</p>
<ul class="org-ul">
<li>The basic categorisation of adjectives depends on whether it takes comparative morphology (-ЫрАҚ), can be substantivised (acts like a noun), and/or can be adverbialised (acts like an adverb).  Be sure to put the adjective in the right category according what those categories allow.
</li>

<li>If you're adding an adjective that can also be used as a noun, think whether it's actually an adjective or actually a noun and add it to the right category.  You'll want to subcategorise it correctly so that e.g. if it's an adjective it can also take the {{tag|subst}} tag.
</li>
</ul>

<p>
<code>==</code> Adverbs <code>==</code>
</p>
<ul class="org-ul">
<li>If you want to add an adverb, first think whether the word is really an adjective that can be used like an adverb.  If this is the case, then add it as an adjective in the appropriate adjective class that can take the {{tag|advl}} tag.  In the bidix, you'll want to translate the {{tag|adj}} and the {{tag|adj}}{{tag|advl}} forms differently.
</li>
</ul>

<p>
<code>=</code> Additional tags <code>=</code>
</p>

<p>
In a .lexc file, after the '!' you will also see &lt;code&gt;Dir/LR&lt;/code&gt;, &lt;code&gt;Dir/RL&lt;/code&gt;, &lt;code&gt;Err/Orth&lt;/code&gt; and &lt;code&gt;Use/MT&lt;/code&gt; comments. The meaning of them is as follows:
</p>

<p>
'''&lt;code&gt;Dir/LR&lt;/code&gt;''' means: analyse this surface form, but don't generate it. Here is a good example:
</p>

<p>
&lt;pre&gt;
сұхбат:сұқбат N1 ; ! "conversation/interview" Dir/LR
сұхбат:сұхбат N1 ; ! "conversation/interview"
&lt;/pre&gt;
</p>

<p>
In other words, &lt;code&gt;Dir/LR&lt;/code&gt; marks alternative spellings of a word. If the alternative spelling isn't just alternative, but actually erroneous (but occurs quite commonly so that you want to support it), it is marked with the '''&lt;code&gt;Err/Orth&lt;/code&gt;''' tag:
</p>

<p>
&lt;pre&gt;
орын:ор%{y%}н N1 ; ! "place,seat"
орын:орын N1 ; ! "place,seat"  ! Dir/LR ! Err/Orth
&lt;/pre&gt;
</p>

<p>
"Орыны" for example, is considered erroneous spelling of "орын&lt;n&gt;&lt;px3sp&gt;&lt;nom&gt;". Such markings will allow us to produce better spell checkers.
</p>

<p>
In the examples above, if you don't mark either of the stems with &lt;code&gt;Dir/LR&lt;/code&gt;, then the Kazakh generator, (if we personify it a bit) given a string like "<sup>сұхбат</sup>&lt;n&gt;&lt;nom&gt;$ for input, won't know which surface form to choose and will output both, separated with a slash: сұхбат/сұқбат.
</p>

<p>
As the name suggests, '''&lt;code&gt;Dir/RL&lt;/code&gt;''' has the meaning opposite to &lt;code&gt;Dir/LR&lt;/code&gt;: 'generate this surface form, but do not analyse it'. You won't see it much in a lexc file and almost certainly won't need to mark a stem you add as Dir/RL. Here is an example though: 
</p>

<p>
&lt;pre&gt;
да:%~да CC ; ! "also" Dir/RL
&lt;/pre&gt;
</p>

<p>
The conjunction ^да&lt;cnj$ gets generated as "~да". This is necessary for a somewhat hacky way of handling the vowel harmony (read: making sure that the "да" gets rendered as "де" when the preceding word has front vowels) in cases where the standard way of handling the vowel harmony (read: <i>twol</i>) fails because the preceding word is unknown. 
</p>

<p>
'''Use/MT''' (at least, in its original usage) marks (compound) words which are needed for translation, but probably shouldn't be in a "vanilla" Kazakh transducer:
</p>

<p>
&lt;pre&gt;
қайда% болса% сонда:қайда% болса% сонда PRON-IND ; ! "anywhere" Use/MT
&lt;/pre&gt;
</p>

<p>
It has been also used to mark words which the person who added them wasn't sure how to classify. Such words will be reviewed later.
</p>

<p>
<code>=</code> Full inventory of lexicons the stems can be linked to <code>=</code>
</p>

<p>
It is useful to distinguish two classes of lexicons:
</p>
<p>
Here is an attempt to document the lexicons of the second kind found in the &lt;code&gt;apertium-kaz.kaz.lexc&lt;/code&gt; file (so that: 1. people can add stems to a lexc file without having to read the lexc file itself 2. we can re-evaluate our decisions):
</p>

<p>
Nouns:
</p>
</div>
</div>
