doc/apertium-kaz.org
** N-INFL-INKI

Proper nouns:
- NP-ANT-F: feminine anthroponyms
- NP-ANT-M: masculine anthroponyms
- NP-COG-OB: family names ending with -ов or -ев
- NP-COG-IN: family names ending with -ин
- NP-COG-M: family name not ending with -ов, -ев or -in; masculine. Example: Галицкий
- NP-COG-F: family name not ending with -ов, -ев or -in; feminine. Example: Толстая
- NP-COG-MF: family names not ending with -ов, -ев or -in which are both masculine and feminine: 
- NP-PAT-VICH: patronyms ending with -вич (and thus which can also take the -вна ending): <code>Васильевич:Василье NP-PAT-VICH ; ! ""</code>
** (could be derived from anthroponyms automatically?)
** NP-TOP: toponyms (in particular, river names should go here too)
** NP-TOP-ASSR: former and future soviet socialistic republic names ending with СР: <code>Қырғыз% КСР:Қырғыз% КСР%{э%}%{й%} NP-TOP-ASSR ;</code>
** NP-ORG: organization names
** NP-ORG-LAT: organization names written in Latin character. Example: Microsoft
** NP-AL: proper names not belonging to one of the above NP-* classes. Example: Восток

Verbs:
- V-TV
- V-IV
- Vinfl-AUX

Adjectives:

- A1: adjectives which can be adverbialised and have a comparative form. Example: жақсы.
** Test 1: can the word in question modify verb? "Жақсы оқиды" OK? A: yes.
** Test 2: has a comparative form? "Жақсырақ" OK? A: yes
** ==> жақсы A1

- A2: adjectives which cannot be adverbialized, but which do have the comparative form. Example: <code>лайық:лайық A2 ; ! ""</code>

- A3: adjectives which can neither be adverbialized nor have comparative form

- A4: initially: adjectives like социал or (tat.) ''биологик'' = (kaz.) ''биологиялық'' which the author of this classification of adjectives thought to never substantivize, but have seen them substativized since then and thus considers deprecated.

The whole purpose of introducing subclasses of adjectives was to avoid overgenerating forms which do not exist.

If you're unsure which adjective lexicon to select, pick A1.

- A6:

Adverbs:

- ADV
- ADV-ITG
- ADV-WITH-KI
- ADV-WITH-KI-I
- ADV-LANG

[[Category:Tools]]
[[Category:Kazakh]]

------------------------------------------------------------------------------------------------------------------------------------------

{{TOCD}}

==Verbal noun or noun==

==Nominal compounds==

When choosing between {{tag|attr}} and {{tag|nom}} in noun1-noun2 compounds, the choice basically depends on if noun2 is marked for possession. If it is marked for possession then you should chose {{tag|nom}}, if not, then choose {{tag|attr}}.

- {{tag|attr}}:
** '''көрші''' елдер
- {{tag|nom}}:
** '''əлем''' чемпионаты

However, there are cases when noun2 is marked for possession but noun1 is not its possessor, e.g. 
"жазба әдебиеті" in a phrase "қазақ жазба әдебиеті". 
<pre>
қазақ       жазба          әдебиеті
Kazakh.NOM  written.ATTR   literature.3SG
</pre>
If we blindly applied the above rule for "жазба әдебиеті", then we would tag "жазба" as {{tag|nom}}, but actually "әдебиеті" is possessed by "қазақ", not by "жазба". 
Moreover, it is possible to drop "i" in "жазба әдебиеті", thus "жазба" is {{tag|attr}}.



<!-- def. izafet: Иранның экономиясы-->

==Specific words==

==="-DA"===

The word "-DA" can be a conjunction or a postadverb:

- <code>cnjcoo</code> [joins two or more noun/verb phrases; it's conjoining two parallel things in the same phrase, as opposed to saying that it's adding one thing to something from before]
** Үстелде қалам '''да''', қарындаш '''та''', дәптер '''де''' жатыр.
** Абай әуелі ауылдағы Ғабитхан молдадан сауатын ашады '''да''', 10 жасқа толған соң 3 жыл Семейдегі Ахмет Риза медресесінде оқиды.
- <code>postadverb</code> [means 'also', 'even', or used for emphasis]
** Мен '''де''' барамын.
** Аузы қисық болса '''да''' байдын баласы сөйлесін.

==="бұл", "мынау", "осы", "мына", "анау", "ана", "сол"===

The word "бұл" (along with "мынау", "осы", "мына", "анау", "ана", "сол") can be either a determiner, modifying a noun phrase, or a pronoun, replacing a noun phrase.

 <code>det.dem</code>
** '''Мынау''' үй жаңа.
- <code>prn</code>
** '''Мынау''' — терезе емес.
[[Category:Kazakh]]

The way to tell is whether it's part of the following noun phrase (det dem) or separate from it (prn)

===Verbs in dictionary form===

A verb in a dictionary form (gerund) can sometimes be a noun.
- <code>ger</code>
** Кітап '''оқу''' адамдарды ақылдырақ етеді.
- <code>n</code>
** '''Оқу''' басталды.

With gerunds you often get embedded arguments, like "кітап" in the example above.

If there is an adjective or determiner preceding: noun.

Some cases are ambiguous: Балалардың '''оқу'''ы жақсы болды.  Here, it's unclear whether бала is the subject of a verbal noun or the possessor of a noun.  In cases like this, the context can sometimes provide some intuition; e.g., in "Балалардың '''оқу'''ы басталды.", оқу seems more like a noun and less like a gerund.  In such ambiguous cases, if you have an intuition, go with that.  If not, go with verbal noun (the reason being that we would need more things in our lexicon, and also that these "noun" are derived from verbs anyway).

===Perfect participle or Verbal adverb===

Perfect participle (<code>prc_perf</code>) if there is an auxiliary following, otherwise verbal adverb (<code>gna_perf</code>)
- <code>prc_perf</code>
** Ол кәзір '''ұйықтап''' жатыр.
- <code>gna_perf</code>
** Мектепті '''бітіріп''', университетке түстім.
