doc/apertium-kaz.html
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> N1</h3>
</div>
<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> N-COMPOUND-PX</h3>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> N5</h3>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> N1-ABBR</h3>
</div>
<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> N-INFL-INKI</h3>
<div class="outline-text-3" id="text-1-18">
<p>
Proper nouns:
</p>
<ul class="org-ul">
<li>NP-ANT-F: feminine anthroponyms
</li>
<li>NP-ANT-M: masculine anthroponyms
</li>
<li>NP-COG-OB: family names ending with -ов or -ев
</li>
<li>NP-COG-IN: family names ending with -ин
</li>
<li>NP-COG-M: family name not ending with -ов, -ев or -in; masculine. Example: Галицкий
</li>
<li>NP-COG-F: family name not ending with -ов, -ев or -in; feminine. Example: Толстая
</li>
<li>NP-COG-MF: family names not ending with -ов, -ев or -in which are both masculine and feminine: 
</li>
<li>NP-PAT-VICH: patronyms ending with -вич (and thus which can also take the -вна ending): &lt;code&gt;Васильевич:Василье NP-PAT-VICH ; ! ""&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> (could be derived from anthroponyms automatically?)</h3>
</div>
<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> NP-TOP: toponyms (in particular, river names should go here too)</h3>
</div>
<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> NP-TOP-ASSR: former and future soviet socialistic republic names ending with СР: &lt;code&gt;Қырғыз% КСР:Қырғыз% КСР%{э%}%{й%} NP-TOP-ASSR ;&lt;/code&gt;</h3>
</div>
<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> NP-ORG: organization names</h3>
</div>
<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> NP-ORG-LAT: organization names written in Latin character. Example: Microsoft</h3>
</div>
<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="section-number-3">1.24</span> NP-AL: proper names not belonging to one of the above NP-* classes. Example: Восток</h3>
<div class="outline-text-3" id="text-1-24">
<p>
Verbs:
</p>
<ul class="org-ul">
<li>V-TV
</li>
<li>V-IV
</li>
<li>Vinfl-AUX
</li>
</ul>

<p>
Adjectives:
</p>

<ul class="org-ul">
<li>A1: adjectives which can be adverbialised and have a comparative form. Example: жақсы.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="section-number-3">1.25</span> Test 1: can the word in question modify verb? "Жақсы оқиды" OK? A: yes.</h3>
</div>
<div id="outline-container-sec-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="section-number-3">1.26</span> Test 2: has a comparative form? "Жақсырақ" OK? A: yes</h3>
</div>
<div id="outline-container-sec-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="section-number-3">1.27</span> ==&gt; жақсы A1</h3>
<div class="outline-text-3" id="text-1-27">
<ul class="org-ul">
<li>A2: adjectives which cannot be adverbialized, but which do have the comparative form. Example: &lt;code&gt;лайық:лайық A2 ; ! ""&lt;/code&gt;
</li>

<li>A3: adjectives which can neither be adverbialized nor have comparative form
</li>

<li>A4: initially: adjectives like социал or (tat.) ''биологик'' = (kaz.) ''биологиялық'' which the author of this classification of adjectives thought to never substantivize, but have seen them substativized since then and thus considers deprecated.
</li>
</ul>

<p>
The whole purpose of introducing subclasses of adjectives was to avoid overgenerating forms which do not exist.
</p>

<p>
If you're unsure which adjective lexicon to select, pick A1.
</p>

<ul class="org-ul">
<li>A6:
</li>
</ul>

<p>
Adverbs:
</p>

<ul class="org-ul">
<li>ADV
</li>
<li>ADV-ITG
</li>
<li>ADV-WITH-KI
</li>
<li>ADV-WITH-KI-I
</li>
<li>ADV-LANG
</li>
</ul>

<p>
<i>Category:Tools</i>
<i>Category:Kazakh</i>
</p>

<hr  />

<p>
{{TOCD}}
</p>

<p>
<code>=Verbal noun or noun=</code>
</p>

<p>
<code>=Nominal compounds=</code>
</p>

<p>
When choosing between {{tag|attr}} and {{tag|nom}} in noun1-noun2 compounds, the choice basically depends on if noun2 is marked for possession. If it is marked for possession then you should chose {{tag|nom}}, if not, then choose {{tag|attr}}.
</p>

<ul class="org-ul">
<li>{{tag|attr}}:
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="section-number-3">1.28</span> '''көрші''' елдер</h3>
<div class="outline-text-3" id="text-1-28">
<ul class="org-ul">
<li>{{tag|nom}}:
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="section-number-3">1.29</span> '''əлем''' чемпионаты</h3>
<div class="outline-text-3" id="text-1-29">
<p>
However, there are cases when noun2 is marked for possession but noun1 is not its possessor, e.g. 
"жазба әдебиеті" in a phrase "қазақ жазба әдебиеті". 
&lt;pre&gt;
қазақ       жазба          әдебиеті
Kazakh.NOM  written.ATTR   literature.3SG
&lt;/pre&gt;
If we blindly applied the above rule for "жазба әдебиеті", then we would tag "жазба" as {{tag|nom}}, but actually "әдебиеті" is possessed by "қазақ", not by "жазба". 
Moreover, it is possible to drop "i" in "жазба әдебиеті", thus "жазба" is {{tag|attr}}.
</p>



<p>
&lt;!&#x2013; def. izafet: Иранның экономиясы&#x2013;&gt;
</p>

<p>
<code>=Specific words=</code>
</p>

<p>
<code>=</code>"-DA"<code>=</code>
</p>

<p>
The word "-DA" can be a conjunction or a postadverb:
</p>

<ul class="org-ul">
<li>&lt;code&gt;cnjcoo&lt;/code&gt; [joins two or more noun/verb phrases; it's conjoining two parallel things in the same phrase, as opposed to saying that it's adding one thing to something from before]
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="section-number-3">1.30</span> Үстелде қалам '''да''', қарындаш '''та''', дәптер '''де''' жатыр.</h3>
</div>
<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="section-number-3">1.31</span> Абай әуелі ауылдағы Ғабитхан молдадан сауатын ашады '''да''', 10 жасқа толған соң 3 жыл Семейдегі Ахмет Риза медресесінде оқиды.</h3>
<div class="outline-text-3" id="text-1-31">
<ul class="org-ul">
<li>&lt;code&gt;postadverb&lt;/code&gt; [means 'also', 'even', or used for emphasis]
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-32" class="outline-3">
<h3 id="sec-1-32"><span class="section-number-3">1.32</span> Мен '''де''' барамын.</h3>
</div>
<div id="outline-container-sec-1-33" class="outline-3">
<h3 id="sec-1-33"><span class="section-number-3">1.33</span> Аузы қисық болса '''да''' байдын баласы сөйлесін.</h3>
<div class="outline-text-3" id="text-1-33">
<p>
<code>=</code>"бұл", "мынау", "осы", "мына", "анау", "ана", "сол"<code>=</code>
</p>

<p>
The word "бұл" (along with "мынау", "осы", "мына", "анау", "ана", "сол") can be either a determiner, modifying a noun phrase, or a pronoun, replacing a noun phrase.
</p>

<p>
&lt;code&gt;det.dem&lt;/code&gt;
</p>
</div>
</div>
<div id="outline-container-sec-1-34" class="outline-3">
<h3 id="sec-1-34"><span class="section-number-3">1.34</span> '''Мынау''' үй жаңа.</h3>
<div class="outline-text-3" id="text-1-34">
<ul class="org-ul">
<li>&lt;code&gt;prn&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-35" class="outline-3">
<h3 id="sec-1-35"><span class="section-number-3">1.35</span> '''Мынау''' — терезе емес.</h3>
<div class="outline-text-3" id="text-1-35">
<p>
<i>Category:Kazakh</i>
</p>

<p>
The way to tell is whether it's part of the following noun phrase (det dem) or separate from it (prn)
</p>

<p>
<code>==Verbs in dictionary form==</code>
</p>

<p>
A verb in a dictionary form (gerund) can sometimes be a noun.
</p>
<ul class="org-ul">
<li>&lt;code&gt;ger&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-36" class="outline-3">
<h3 id="sec-1-36"><span class="section-number-3">1.36</span> Кітап '''оқу''' адамдарды ақылдырақ етеді.</h3>
<div class="outline-text-3" id="text-1-36">
<ul class="org-ul">
<li>&lt;code&gt;n&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-37" class="outline-3">
<h3 id="sec-1-37"><span class="section-number-3">1.37</span> '''Оқу''' басталды.</h3>
<div class="outline-text-3" id="text-1-37">
<p>
With gerunds you often get embedded arguments, like "кітап" in the example above.
</p>

<p>
If there is an adjective or determiner preceding: noun.
</p>

<p>
Some cases are ambiguous: Балалардың '''оқу'''ы жақсы болды.  Here, it's unclear whether бала is the subject of a verbal noun or the possessor of a noun.  In cases like this, the context can sometimes provide some intuition; e.g., in "Балалардың '''оқу'''ы басталды.", оқу seems more like a noun and less like a gerund.  In such ambiguous cases, if you have an intuition, go with that.  If not, go with verbal noun (the reason being that we would need more things in our lexicon, and also that these "noun" are derived from verbs anyway).
</p>

<p>
<code>==Perfect participle or Verbal adverb==</code>
</p>

<p>
Perfect participle (&lt;code&gt;prc<sub>perf</sub>&lt;/code&gt;) if there is an auxiliary following, otherwise verbal adverb (&lt;code&gt;gna<sub>perf</sub>&lt;/code&gt;)
</p>
<ul class="org-ul">
<li>&lt;code&gt;prc<sub>perf</sub>&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-38" class="outline-3">
<h3 id="sec-1-38"><span class="section-number-3">1.38</span> Ол кәзір '''ұйықтап''' жатыр.</h3>
<div class="outline-text-3" id="text-1-38">
<ul class="org-ul">
<li>&lt;code&gt;gna<sub>perf</sub>&lt;/code&gt;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-39" class="outline-3">
<h3 id="sec-1-39"><span class="section-number-3">1.39</span> Мектепті '''бітіріп''', университетке түстім.</h3>
</div>
